{
    "Potato___Early_blight" : [
        {
            "What caused it?" : "Potato early blight is caused by a fungal pathogen called Alternaria solani. The disease is favored by warm and humid weather conditions, as well as poor plant nutrition, plant stress, infected seed potatoes, crop residue, and poor sanitation practices. These factors can weaken the potato plant's immune system, making it more susceptible to infection and disease. The disease is characterized by dark lesions on the leaves, stems, and tubers of potato plants, and can cause significant damage to crops if left untreated.",
            "Chemical Control" : "Fungicides can be used to control early blight, but should be used sparingly and as a last resort. It is important to follow all safety precautions and label instructions when using chemical fungicides.",
            "Preventive Measures" : ">Maintain proper plant nutrition, including adequate soil fertility and balanced fertilization. \n>Avoid overwatering or underwatering plants, as plant stress can increase susceptibility to disease. \n>Control weeds, which can harbor the early blight pathogen.  \n>Monitor fields for early blight symptoms and take action quickly to control the disease."
            ,
            "Medicines" : "Chlorothalonil : 'https://www.amazon.in/Tata-Ishaan-Chlorothalonil-75-250/dp/B08TVVLRGZ'  \nMancozeb : 'https://dir.indiamart.com/impcat/mancozeb.html'"
            
        }
    ],
    "Potato___Late_Blight" : [
        {
            "What Caused it?" : "The risk of infection is highest in midsummer. The fungus enters the plant via wounds and rips in the skin. Temperature and moisture are the most important environmental factors affecting the development of the disease. Late blight fungi grow best in high relative humidities (around 90%) and in temperature ranges of 18 to 26째C. Warm and dry summer weather can bring the spread of the disease to a halt."
            ,
            "Chemical Control" : "Always consider an integrated approach with preventive measures together with biological treatments if available. Use fungicide sprays based on mandipropamid, chlorothalonil, fluazinam, mancozeb to combat late blight. Fungicides are generally needed only if the disease appears during a time of year when rain is likely or overhead irrigation is practiced." 
            ,
            "Preventive Measures" : "> Purchase healthy seeds from reliable retailers. \n> Plant more resilient varieties. \n> Tomatoes and potatoes should not be cultivated next to each other. \n> Try to keep plants dry through good drainage and ventilation of your cultures. \n> Install a simple transparent rain shelter with the help of a tarpaulin and wooden stakes. > Use plant fortifier for general strengthening of the plants. > Crop rotation of two to three years with non-host crops is recommended. \n> Silicate-containing fertilizers may increase the resistance to the fungus, especially in the seedling stage. \n> Avoid irrigation late in the day and irrigate plants at ground level. > Disinfect field equipment and tools." 
            ,
            "Medicines" : ""
        }
        
    ],
    "Tomato_healthy" : [
        {
            
            "What caused it?" : "",
            "Chemical Control" : "",
            "Preventive Measures" : "",
            "Medicines" : ""
        }
    ],
    "Tomato_Bacterial_spot" : [
        {
            "What caused it?" : "Bacterial Spot and Speck are caused by several species of bacteria of the genus Xanthomonas, and Pseudomonas syringae pv. tomato. Bacterial spot occurs worldwide and is one of the most devastating diseases on tomatoes grown in warm, moist environments. The pathogens can survive in or on seeds, plant debris, and specific weeds. Xanthomonas has a limited survival period of days to weeks in the soil. Secondary infection can occur through rain or overhead irrigation. It enters the plant tissues through leaf pores and wounds. Optimal temperatures range from 25 to 30째C for the bacterial spot. Once the crop is infected, the disease is very difficult to control and can lead to total crop losses. Bacterial speck outbreaks are relatively infrequent and are favored by prolonged leaf moisture and cool temperatures." 
            ,
            "Chemical Control" : "Always consider an integrated approach with preventive measures together with biological treatments, if available. Copper-containing bactericides can be used as a protectant and give partial disease control. Application at first sign of disease and then at 10 to 14-day intervals when warm (spot) / cold (speck), moist conditions prevail. As the development of resistance to copper is frequent, a combination of copper-based bactericide with mancozeb is also recommended. "
            ,
            "Preventive Measures " : "> Plant disease-free seeds if possible from a certified source. \n> Use resistant varieties if available locally. \n> Inspect field regularly, particularly during overcast weather. \n> Avoid injuring transplants during handling or planting. \n> Ensure sufficient space between plants and use stakes to keep them upright. \n> Remove and burn any seedling or plant part with leaf spots. \n> Remove weeds in and around the field. \n> Mulch the soil to avoid soil-to-plant contamination. \n> Clean tools and equipment. \n> Avoid overhead irrigation and working in fields when foliage is wet." 
            ,
            "Medicines" : "Marlett M-45 : 'https://shop.plantix.net/en/products/pesticides/e02ce3e3-35cd-400c-94fd-e4063875671c/marlett-m-45-coromandel-/?utm_campaign=WebLibraryDiseasePage' \nAbic : 'https://shop.plantix.net/en/products/pesticides/3b027c35-b984-4a51-9239-c0b88c550c23/abic-syngenta-/?utm_campaign=WebLibraryDiseasePage'"
        }
    ],
    "Tomato_Early_blight" : [
        {
            "What caused it?" : "Early blight of tomato is caused primarily by the fungus Alternaria linariae (=A. tomatophila; formerly known as A. solani), although other species of Alternaria may be isolated from lesions.",
            "Chemical Control" : "Always consider an integrated approach with preventive measures and biological treatments if available. There are numerous fungicides on the market for controlling early blight. Fungicides based on or combinations of azoxystrobin, pyraclostrobin, difenoconazole, boscalid, chlorothalonil, fenamidone, maneb, mancozeb, trifloxystrobin, and ziram can be used. Rotation of different chemical compounds is recommended. Apply treatments in a timely manner, taking into account weather conditions. Check carefully the preharvest interval at which you can harvest safely after the application of these products." 
            ,
            "Preventive Measures" : "> Use certified pathogen-free seeds or transplants. \n> Look for varieties that are resistant to the disease. \n> Plant or transplant on raised beds to improve drainage. \n> Orient rows in the direction of main winds and avoid shaded areas. \n> Space plants to allow the canopy to dry quickly after rainfall or irrigation. \n> Lay mulch on the soil to keep plants from touching the soil. \n> Monitor fields for signs of the disease, particularly during wet weather. \n> Remove bottom leaves that are too close to the soil. \n> Remove leaves displaying symptoms and destroy them. \n> Keep plants strong and vigorous with an adequate nutrition. \n> Use stakes to keep plants upright. \n> Use a drip irrigation system to minimize leaf wetness. "
            ,
            "Medicines" : " Startgem-45 : 'https://shop.plantix.net/en/products/pesticides/9d49366b-127b-41aa-8025-459c88417284/stargem-45-swal-/?utm_campaign=WebLibraryDiseasePage' \nUthane M-45 : 'https://shop.plantix.net/en/products/pesticides/6650dea9-65db-4e46-a7aa-73aaf6bdab97/uthane-m-45-upl-/?utm_campaign=WebLibraryDiseasePage'"

        }
    ],
    "Tomato_Late_blight" : [
        {
            
            "What caused it?" : "The risk of infection is highest in midsummer. The fungus enters the plant via wounds and rips in the skin. Temperature and moisture are the most important environmental factors affecting the development of the disease. Late blight fungi grow best in high relative humidities (around 90%) and in temperature ranges of 18 to 26째C. Warm and dry summer weather can bring the spread of the disease to a halt." 
            ,
            "Chemical Control" : "Always consider an integrated approach with preventive measures together with biological treatments if available. Use fungicide sprays based on mandipropamid, chlorothalonil, fluazinam, mancozeb to combat late blight. Fungicides are generally needed only if the disease appears during a time of year when rain is likely or overhead irrigation is practiced. "
            ,
            "Preventive Measures" : "> Purchase healthy seeds from reliable retailers. \n> Plant more resilient varieties. \n> Tomatoes and potatoes should not cultivated next to each other. \n> Try to keep plants dry through good drainage and ventilation of your cultures. \n> Install a simple transparent rain shelter with the help of a tarpaulin and wooden stakes. \n> Use plant fortifier for general strengthening of the plants. \n> Crop rotation of two to three years with non-host crops is recommended. \n> Silicate-containing fertilizers may increase the resistance to the fungus, especially in the seedling stage. \n> Avoid irrigation in the day and irrigate plants at ground level. \n> Disinfect field equipment and tools." 
            ,
            "Medicines" : "Superhit: 'https://shop.plantix.net/en/products/pesticides/7e0d6ac3-3dce-4331-8004-e0824282c509/superhit-hpm-/?utm_campaign=WebLibraryDiseasePage' \nUthane : 'https://shop.plantix.net/en/products/pesticides/6650dea9-65db-4e46-a7aa-73aaf6bdab97/uthane-m-45-upl-/?utm_campaign=WebLibraryDiseasePage' \nMacoban : 'https://shop.plantix.net/en/products/pesticides/80912a74-dcc2-43e0-8cea-d8ec827ead3e/macoban-m-45-adama-/?utm_campaign=WebLibraryDiseasePage'"
        }
    ],
    "Tomato_Leaf_Mold" : [
        {
            
            "What caused it?" : "Tomato leaf mold is a fungal disease that affects the foliage of tomato plants. It is caused by the pathogen Fulvia fulva (formerly known as Cladosporium fulvum). The main causes of tomato leaf mold include:  \nHumidity: High humidity levels can create an environment that is conducive to the growth and spread of tomato leaf mold. The fungus thrives in moist conditions and can spread quickly in humid environments  \nWarm temperatures: Warm temperatures (around 70-75째F) also create ideal conditions for the growth and spread of tomato leaf mold. The fungus can rapidly reproduce in warm weather and can cause significant damage to the tomato plants.  \nOverhead watering: Overhead watering can contribute to the development and spread of tomato leaf mold. When the foliage of the tomato plants gets wet, it creates a moist environment that is favorable for the growth of the fungus.  \nPoor air circulation: Poor air circulation can also contribute to the development of tomato leaf mold. When there is not enough air movement around the plants, moisture can accumulate on the foliage and provide a perfect breeding ground for the fungus.",
            "Chemical Control" : "Chemical control options for tomato leaf mold typically involve the use of fungicides. Here are some common fungicides that can be used to control tomato leaf mold: \nCopper fungicides: Copper-based fungicides are another option for controlling tomato leaf mold. They work by disrupting the growth of fungal spores and can be applied as a spray or dust. \n",
            "Preventive Measures" : "The following are some preventive measures that can help to reduce the risk of tomato leaf mold:  \nChoose resistant tomato varieties: Some tomato varieties are resistant to leaf mold, and choosing such varieties can reduce the risk of infection. \nKeep the leaves dry: Moisture on the leaves provides an ideal environment for fungal growth, so it is essential to keep the leaves dry. Water the plants at the base, and avoid getting the leaves wet while watering. Also, avoid overhead watering, especially during humid conditions.  \nProvide good air circulation: Good air circulation helps to reduce humidity around the plants, making it less conducive for fungal growth. Plant the tomato plants with adequate spacing, and avoid overcrowding.",
            "Medicines" : " Propiconazole : 'https://agribegri.com/products/katyayani-prodizole--propiconazole-139--difenoconazole-139.php' "
        }
    ],
    "Tomato_Septoria_leaf_spot" : [
        {
            "What caused it?" : "is most commonly seen in warm, humid and wet conditions. The fungus infects the lower leaves of tomato plants and causes small, dark spots to form on the leaves. As the disease progresses, the spots become larger and more numerous, and may coalesce, leading to the death of the leaves. \n The fungus survives on plant debris and can overwinter on infected plant material. Spores can be spread by wind, rain, irrigation, and tools or equipment. "
            ,
            "Chemical Control" : "Chemical control of Tomato Septoria leaf spot can be achieved using fungicides. However, it is important to note that the overuse of fungicides can lead to the development of fungicide-resistant strains of the fungus. Therefore, chemical control should be used in conjunction with other management practices, such as crop rotation and good cultural practices, to reduce the risk of resistance development.",
            "Preventive Measures" : "Crop rotation: Avoid planting tomatoes in the same location for at least three years. This can help reduce the buildup of the fungus in the soil.cSanitation: Remove infected plant debris and destroy it. This will reduce the amount of inoculum available for the fungus to infect new plants.  \n  Pruning: Prune the lower branches of tomato plants to increase air circulation and reduce humidity, which can help prevent the spread of the disease.  \nWater management: Avoid overhead irrigation, which can promote the spread of the disease. Instead, use drip irrigation or soaker hoses.\nFertilization: Maintain adequate nutrient levels, especially nitrogen, to promote plant health and reduce susceptibility to the disease.",
            "Medicines" : " As I mentioned earlier, fungicides that are commonly used to control Tomato Septoria leaf spot include Chlorothalonil, Azoxystrobin, Mancozeb, and Copper-based fungicides. It is important to follow the label instructions carefully when applying fungicides and to use appropriate personal protective equipment"
        }
    ],
    "Tomato_Spider_mites_Two_spotted_spider_mite" : [
        {
            "What caused it?" : "Tomato Spider Mites, also known as Two-spotted spider mites, are caused by the spider mite species Tetranychus urticae. These tiny pests are members of the arachnid family and feed on the sap of tomato plants by piercing the leaves and sucking out the plant fluids.  \nTwo-spotted spider mites thrive in hot, dry conditions and are most commonly seen during the summer months. They can be spread by wind, animals, and humans. Once they infest a tomato plant, they can quickly multiply and cause extensive damage.",
            "Chemical Control " : "Acaricides: These are insecticides that are specifically designed to control mites. Some commonly used acaricides for controlling Two-spotted spider mites on tomatoes include abamectin, bifenazate, and spiromesifen.  \nInsecticidal soap: This is a low-toxicity insecticide that can be used to control spider mites on tomato plants. It works by suffocating the mites and disrupting their cell membranes.Neem oil: This is a natural oil that is derived from the neem tree. It works by disrupting the mites' feeding and reproductive systems and has low toxicity to humans and other animals.",
            "Preventive Measures" : "nfestations, such as yellowing or bronzing of leaves, stippling, and webbing. \nKeep plants healthy: Maintain good plant health by providing adequate water, nutrients, and sunlight. Stressed plants are more susceptible to mite infestations.  \nAvoid excessive use of nitrogen fertilizer: Excessive nitrogen can promote rapid growth of new foliage, which can attract mites."
            ,
            "Medicines" : "Abamectin: 'https://www.bighaat.com/products/abacin-insecticide?variant=31281161961495&currency=INR&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_source=Google&utm_medium=CPC&utm_campaign=17706716593&utm_adgroup=&utm_term=&creative=&device=c&devicemodel=&matchtype=&feeditemid=&targetid=&network=x&placement=&adposition=&GA_loc_interest_ms=&GA_loc_physical_ms=1007747&gclid=Cj0KCQjw_r6hBhDdARIsAMIDhV-kERf7yEWAlxNFOfClFCqrunNAqDqoo2rp7_7Ei3JcVrQ__gOtSssaAq4cEALw_wcB'  "
        }
    ],
    "Tomato__Target_Spot" : [
        {
            "What caused it?" : "omato target spot is caused by the fungal pathogen Corynespora cassiicola. This disease is characterized by small, circular lesions on leaves, stems, and fruit that have a concentric ring pattern. The lesions may start out as dark spots and then develop a light center as they enlarge. Severe infections can cause leaf yellowing, defoliation, and even fruit rot.",
            "Chemical Control" : "Chlorothalonil: This is a broad-spectrum fungicide that is effective against many fungal diseases, including target spot. It can be applied as a foliar spray. Azoxystrobin: This is a systemic fungicide that is absorbed by the plant and provides long-lasting control. It is effective against many fungal diseases, including target spot.Pyraclostrobin: This is a broad-spectrum fungicide that is effective against many fungal diseases, including target spot. It can be applied as a foliar spray.",
            "Preventive Measures" : "Plant resistant tomato varieties: Plant tomato varieties that are resistant to target spot if they are available.Practice good crop management: Practice good crop management techniques such as crop rotation, removing diseased plant debris, and using clean equipment and tools.Monitor plants regularly: Monitor tomato plants regularly for signs of target spot and other diseases. Early detection can help prevent the spread of the disease."
            ,
            "Medicines" : "Chlorothaline  :  https://www.netmeds.com/prescriptions/ctd-12-5mg-tablet-15-s  "
        }
    ],
    "Tomato__Tomato_YellowLeaf__Curl_Virus" : [
        {
            "What caused it?" : "TYLCV is not seed-borne and is not transmitted mechanically. It is spread by whiteflies of the Bemisia tabaci species. These whiteflies feed on the lower leaf surface of a number of plants and are attracted by young tender plants. The whole infection cycle can take place in about 24 hours and is favored by dry weather with high temperatures. "
            ,
            "Chemical Control" : "Once infected with the virus, there are no treatments against the infection. Control the whitefly population to avoid the infection with the virus. Insecticides of the family of the pyrethroids used as soil drenches or spray during the seedling stage can reduce the population of whiteflies. However, their extensive use might promote resistance development in whitefly populations. "
            ,
            "Preventive Measures" : "> Use resistant or tolerant varieties. \n> Plant early to avoid peak populations of the whitefly. \n> Intercrop with rows of non-susceptible plants such as squash and cucumber. \n> Use nets to cover seedbeds and prevent whiteflies from reaching plants. \n> Practice crop rotation with non-susceptible plants. \n> Avoid planting alternative host plants close to crops. \n> Mulch the seedbed or the field to break the life cycle of the whitefly. \n> Use sticky yellow plastic traps to mass-catch the insect." 
            ,
            "Medicines": " Geolife no virus : 'https://www.bighaat.com/products/geolife-no-virus-organic-viricide-for-tomato-cucurbit-chilli-plants-500ml?variant=32934401507351&currency=INR&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_source=Google&utm_medium=CPC&utm_campaign=17706716593&utm_adgroup=&utm_term=&creative=&device=c&devicemodel=&matchtype=&feeditemid=&targetid=&network=x&placement=&adposition=&GA_loc_interest_ms=&GA_loc_physical_ms=1007747&gclid=Cj0KCQjw_r6hBhDdARIsAMIDhV8OJ8s5UELPwfw1wTJ7I8StkFixIOMGpdmV-NI8T4P_YVq76A_-ELIaAjr4EALw_wcB'  \nV-Bind Bio viricide : 'https://www.bighaat.com/products/v-bind?variant=40351546638359&currency=INR&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_source=Google&utm_medium=CPC&utm_campaign=17706716593&utm_adgroup=&utm_term=&creative=&device=c&devicemodel=&matchtype=&feeditemid=&targetid=&network=x&placement=&adposition=&GA_loc_interest_ms=&GA_loc_physical_ms=1007747&gclid=Cj0KCQjw_r6hBhDdARIsAMIDhV-pKAauscTqCGQz5aQ9xm33OgNQZgBsw3M8ZbhXAOd9CbOMqX_UAV4aAkmrEALw_wcB'"
        }
    ],
    "Tomato__Tomato_mosaic_virus" : [
        {
            
            "What caused it?" : "The virus can persist in plant or root debris in dry soil for periods of over 2 years (1 month in most soils). Plants get contaminated through minor wounds in roots. The virus can spread via infested seeds, seedlings, weeds, and contaminated plant parts. Wind, rain, grasshoppers, small mammals, and birds can also transport the virus between fields. Bad cultural practices during plant handling favor virus transmission, too. Day length, temperature, and light intensity, as well as plant variety and age, determine the severity of the infection." 
            ,
            "Chemical Control" : "Always consider an integrated approach with preventive measures together with biological treatments if available. There is no effective chemical treatment against Tomato Mosaic Virus." 
            ,
            "Preventive Measures" : "> Use seeds from healthy plants or from certified sources. \n> Use resistant or tolerant varieties. \n> Use steam-pasteurization to rid your seedbed soils of the virus. \n> Do not plant in fields previously infected by the virus. \n> Optimize the handling of the plants by washing hands, wearing gloves and disinfecting your tools and equipment. \n> Do not consume tobacco products (such as cigarettes) around tomato plants. \n> Monitor seedbeds and fields, remove diseased plants and burn them. \n> Find and eradicate weeds in and around the field. \n> Plow and burn plant debris after harvest." 
            ,
            "Medicines" :" Tomato and Gourd Farming Special for Virus Control : 'https://agribegri.com/products/tomato-virus-special-.php'  \nVirus : 'https://www.badikheti.com/botanical-products/pdp/viroz-viricide-controls-yellow-mosaic-and-leaf-curl-virus-natural-plant-protector/x5p8aigj'"
        }
    ],
    "Pepper__bell___healthy" : [
        {
            
            "What caused it?" : "",
            "Chemical Control" : "",
            "Preventive Measures" : "",
            "Medicines" : ""
        }
    ],
    "Pepper__bell___Bacterial_spot" : [
        {
            "What caused it?" : "Bacterial spot is a common disease that affects pepper plants, caused by the bacteria Xanthomonas campestris. The disease can cause significant yield losses if left uncontrolled. There are several factors that can contribute to the development of bacterial spot in pepper plants, including:  \nContaminated seeds: The bacteria can be transmitted through contaminated seeds, so using certified disease-free seeds is crucial. \nPoor sanitation: The bacteria can survive in plant debris and soil, so poor sanitation practices, such as not removing infected plant debris or not sterilizing gardening tools, can contribute to the spread of the disease.",
            "Chemical Control" : "Chemical control of bacterial spot in pepper plants typically involves the use of copper-based fungicides, such as copper sulfate or copper hydroxide. These fungicides work by killing the bacteria on the surface of the plant, preventing further spread of the disease.  \nTo effectively control bacterial spot using chemical means, it is important to follow these guidelines:  \nBegin treatment early: At the first sign of symptoms, begin treatment with a copper-based fungicide. This will help prevent the spread of the disease to healthy plants.  \nApply regularly: To maintain control, apply the fungicide at regular intervals throughout the growing season, as recommended by the manufacturer. ",
            "Preventive Measures" : "Preventing bacterial spot in pepper plants requires a combination of cultural practices and proper plant management techniques. Here are some preventive measures that can be taken to minimize the risk of bacterial spot: \nRotate crops: Avoid planting pepper plants in the same location every year. Rotate with other crops to prevent the buildup of soil-borne pathogens. \nProvide proper plant spacing: Provide adequate plant spacing to promote good air circulation and reduce humidity, which can promote the growth and spread of bacteria.  \nUse certified disease-free seeds: Start with high-quality, certified disease-free seeds to prevent the introduction of the bacteria into the garden.",
            "Medicines" : "Bliss Welness : 'https://www.blisswelness.com/products/bliss-welness-immunity-boost-anti-inflammatory-pure-curcumin-95-extract-turmeric-extract-1000mg-with-biopiperine-10mg-heart-brain-joint-health-antioxidant-high-absorption-supplement-60-vegetarian-tablets?variant=42293997994152&currency=INR&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&gclid=Cj0KCQjw_r6hBhDdARIsAMIDhV_VHxL7G8vtmfR4N5fyWwHXXwcD0o7PuyH8NzL2pdBs773AEF8GrL8aAkUKEALw_wcB'  \n"
        }
    ]
}